app/Models/BlogModel.php

    public function getBlog($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `blog`