app/Models/PortfolioModel.php

    public function getPortfolio($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
---
SELECT *
FROM `portfolio`