app/Models/ServicesModel.php

    public function getServices($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
        } else {
            return $this->Where(['slug' => $slug])->first();
---
SELECT *
FROM `services`
SELECT *
FROM `services`
WHERE `slug` = 'pembuatan-website'
 LIMIT 1